* <2025-05-14 Wed> GE                                                 :Viggo:

Viggo berättade att haan redan gjort en parser för "radformatet" och
producerat en xmlfil. Dock hittade han då ett antal fel i indata:

- en lista med "felstavningar"
- c:a 300 ord som bara saknas.

de saknade orden:
| löpnr | swe_fin                                                                                                |
|-------+--------------------------------------------------------------------------------------------------------|
| 16320 | <Word ID="14758" MatchingID="18880" Type="subst." Value="slipover" Variant="" VariantID="16320">       |
| 16321 | <saknas> <Word ID="14759" MatchingID="18881" Type="verb" Value="slipper" Variant="" VariantID="16321"> |
|   ... | <flera saknade ord>                                                                                    |
| 16686 | <saknas> <Word ID="15093" MatchingID="19301" Type="subst." Value="snus" Variant="" VariantID="16686">  |
| 16687 | <Word ID="15094" MatchingID="19302" Type="verb" Value="snusar" Variant="" VariantID="16687">           |

#+begin_src emacs-lisp
(- 16687 16320)
#+end_src

#+RESULTS:
: 367

Alltså 367 ord.

* <2025-05-15 Thu> GE
Jag har diffat lite impressionistiskt på Viggos fil
=lexinextra/dictionaries/swe_kal.txt= och våra/Bakis filer och tycker
mig se skilllnader åt båda håll. Alltså "våra" verkar bättre/nyare
ibland och ibland tvärtom. Vi behöver nog få (nån slags uppskattning
om) redigeringsdatum av både Baki och Viggo.

Om vi i slutändan ska göra nån slags egen diff på avsiktliga och
ovsiktliga skillnder måste vi sortera materialet ett sätt som
överensstämmer med Viggos sorteringsordning. Det borde ju vara en
trivial sak via unicodes =colllation order=, men det klarar varken
python (säger Magnus) eller raku (vet jag av egen bister
erfarenhet). Så nu började jag skissa på en rudimentär och pinsamt
förskoleliknade lösning:

#+begin_src raku
  my %swe is default(29) = <å 30 ä 31 ö 32>;
  sub swe ($a, $b) {
   if $a, $b ⊂ %swe.keys { # delmängd är förstås fel!
       %swe{$a.lc} cmp %swe{$b.lc} 
   } else { $a coll $b }
  } 


#+end_src

Nja,ovanstående funkar fast på fel grunder:
#+begin_src 
[16] > swe "Z","Ä"
Less
[17] > swe "B","b"
Same
[18] > swe "Ö","b"
More
[19] > swe "Ö","ä"
More
[20] > swe "å","ä"
Less
[21] > swe "Å","Ä"
Less
[22] > swe "Ä","Å"
More
[23] > %swe<A>
29
[24] > %swe<Ö>
29
[25] > %swe<ö>
32
[26] > <Ö A> (<) %swe.keys 
False
[27] > <ö a> (<) %swe.keys 
False
[28] > %swe.keys 
(ö ä å)
[29] > <ö a> (<) <a b c>
False
[30] > <ö ä> (<) <a b c>
False
[31] > <ö ä> (<) <a b c>.Set
False
[32] > <ö ä> (<) <a b c ö ä>
True
[33] > <ö ä> (<) <a b c ö>
False
[34] > <ö ä>.collate
(ä ö)
[35] > <ö ä å>.collate
(å ä ö)
[36] > <Å o O a ö ä m Ö n g å>.collate
(a å Å ä g m n o O ö Ö)
[37] > <ö ä å>.sort
(ä å ö)
[38] > 

#+end_src

#+begin_src raku :results output 
      sub swe ($a, $b) {
          my @in = ($a, $b)».lc; 
          my $swe = <å ä>.Set; 
          #say @in ~~ $swe; 
          

      #    given ($a, $b)».lc {
      #        when * ⊂ $swe and{ say "swe: "  }
      #        default { say "coll"  }
      #    }
    }

  swe "Ä", "Ä"; 
#+end_src 

#+RESULTS:
: False

#+begin_src raku :results output 
  subset Å   of Str where * ∈ <å Å>; 
  subset Ä   of Str where * ∈ <ä Ä>; 
  subset nÅÄ of Str where * ∉ <ä Ä å Å>; 

  multi swe (Å $a, Ä $b) { note 111; Less }
  multi swe (Ä $a, Å $b) { note 222; More }
  multi swe ($a, nÅÄ $b) { note 333; $a coll $b }
  multi swe (nÅÄ $a, $b) { note 444; $a coll $b }




       #my @in = ($a, $b)».lc; 
            #my $swe = <å ä>.Set; 
            #say @in ~~ $swe; 


        #    given ($a, $b)».lc {
        #        when * ⊂ $swe and{ say "swe: "  }
        #        default { say "coll"  }
        #    }
      #}

  say swe "ä", "å"; 
  say "ä" coll "å"; 

  say swe "ö", "o"; 
  say "ö" coll "o"; 
#+end_src 

#+RESULTS:
: More
: More
: More
: More

** DONE ny textkonvertering (med soffice)
Detta för att alla tomrader verkar ha försvunnit i förra (pandoc-?)
konverteringen.
#+begin_src bash
  cd kelderasch_filer
  soffice --headless --convert-to txt --outdir text *.docx 
#+end_src

En ev. nackdel med sofficekonvertering är att denna lägger till en
BOM-markör i början av varje fil, nåt som tydligen windows gillar. Men
eftersomm Viggos resulltatfiler från förra omgången också innehåller
såna så antar jag att det inte kommer ge honomm några problem.

En liten koll:
#+begin_src bash
file kelderasch_filer/text/*.txt
#+end_src

#+RESULTS:
: a.txt: Unicode text, UTF-8 (with BOM) text
: b.txt: Unicode text, UTF-8 (with BOM) text
: c.txt: Unicode text, UTF-8 (with BOM) text
: d.txt: Unicode text, UTF-8 (with BOM) text, with very long lines (301)
: e.txt: Unicode text, UTF-8 (with BOM) text
: f.txt: Unicode text, UTF-8 (with BOM) text
: g.txt: Unicode text, UTF-8 (with BOM) text
: h.txt: Unicode text, UTF-8 (with BOM) text
: i.txt: Unicode text, UTF-8 (with BOM) text
: j.txt: Unicode text, UTF-8 (with BOM) text
: k.txt: Unicode text, UTF-8 (with BOM) text
: l.txt: Unicode text, UTF-8 (with BOM) text
: m.txt: Unicode text, UTF-8 (with BOM) text
: n.txt: Unicode text, UTF-8 (with BOM) text
: o.txt: Unicode text, UTF-8 (with BOM) text
: p.txt: Unicode text, UTF-8 (with BOM) text
: q.txt: Unicode text, UTF-8 (with BOM) text
: r.txt: Unicode text, UTF-8 (with BOM) text
: s.txt: Unicode text, UTF-8 (with BOM) text
: t.txt: Unicode text, UTF-8 (with BOM) text
: u.txt: Unicode text, UTF-8 (with BOM) text
: v.txt: Unicode text, UTF-8 (with BOM) text
: w.txt: Unicode text, UTF-8 (with BOM) text
: x.txt: Unicode text, UTF-8 (with BOM) text
: y.txt: Unicode text, UTF-8 (with BOM) text
: z.txt: Unicode text, UTF-8 (with BOM) text
: ä.txt: Unicode text, UTF-8 (with BOM) text
: å.txt: Unicode text, UTF-8 (with BOM) text
: ö.txt: Unicode text, UTF-8 (with BOM) text

De långa raderna i d är inget syntaaxproblem utan bara väldigt
babbliga förklaringar.

